vishamaev/ChibiOS/os/hal/ports/AT32/AT32F4xx/hal_lld_type1.h
#if defined(STM32F401xx) && !defined(STM32F401_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F401_MCUCONF not defined"
#endif

#if defined(STM32F410xx) && !defined(STM32F410_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F410_MCUCONF not defined"
#endif

#if defined(STM32F411xx) && !defined(STM32F411_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F411_MCUCONF not defined"
#endif

#if defined(STM32F412xx) && !defined(STM32F412_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F412_MCUCONF not defined"
#endif

#if defined(STM32F405xx) && !defined(STM32F405_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F405_MCUCONF not defined"
#endif

#if defined(STM32F415xx) && !defined(STM32F415_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F415_MCUCONF not defined"
#endif

#if defined(STM32F407xx) && !defined(STM32F407_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F407_MCUCONF not defined"
#endif

#if defined(STM32F417xx) && !defined(STM32F417_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F417_MCUCONF not defined"
#endif

#if defined(STM32F427xx) && !defined(STM32F427_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F427_MCUCONF not defined"
#endif

#if defined(STM32F429xx) && !defined(STM32F429_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F429_MCUCONF not defined"
#endif

#if defined(STM32F437xx) && !defined(STM32F437_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F437_MCUCONF not defined"
#endif

#if defined(STM32F439xx) && !defined(STM32F439_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F439_MCUCONF not defined"
#endif

#if defined(STM32F446xx) && !defined(STM32F446_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F446_MCUCONF not defined"
#endif

#if defined(STM32F469xx) && !defined(STM32F469_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F469_MCUCONF not defined"
#endif

#if defined(STM32F479xx) && !defined(STM32F479_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F479_MCUCONF not defined"
#endif

#else /* !defined(STM32F4XX) */
/*
 * Configuration-related checks.
 */
#if !defined(STM32F2xx_MCUCONF)
#error "Using a wrong mcuconf.h file, STM32F2xx_MCUCONF not defined"
#endif
#endif /* !defined(STM32F4XX) */

/**
 * @name    Maximum frequency thresholds, wait states and
 *          parallelism for flash access.
 * @{
 */
#if defined(STM32F429_439xx) || defined(STM32F427_437xx) ||                 \
    defined(STM32F40_41xxx)  || defined(STM32F446xx)     ||                 \
    defined(STM32F469_479xx) || defined(__DOXYGEN__)
#if ((STM32_VDD >= 270) && (STM32_VDD <= 360)) || defined(__DOXYGEN__)
#define STM32_0WS_THRESHOLD         30000000
#define STM32_1WS_THRESHOLD         60000000
#define STM32_2WS_THRESHOLD         90000000
#define STM32_3WS_THRESHOLD         120000000
#define STM32_4WS_THRESHOLD         150000000
#define STM32_5WS_THRESHOLD         180000000
#define STM32_6WS_THRESHOLD         0
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           2
#elif (STM32_VDD >= 240) && (STM32_VDD < 270)
#define STM32_0WS_THRESHOLD         24000000
#define STM32_1WS_THRESHOLD         48000000
#define STM32_2WS_THRESHOLD         72000000
#define STM32_3WS_THRESHOLD         96000000
#define STM32_4WS_THRESHOLD         120000000
#define STM32_5WS_THRESHOLD         144000000
#define STM32_6WS_THRESHOLD         168000000
#define STM32_7WS_THRESHOLD         180000000
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           1
#elif (STM32_VDD >= 210) && (STM32_VDD < 240)
#define STM32_0WS_THRESHOLD         22000000
#define STM32_1WS_THRESHOLD         44000000
#define STM32_2WS_THRESHOLD         66000000
#define STM32_3WS_THRESHOLD         88000000
#define STM32_4WS_THRESHOLD         110000000
#define STM32_5WS_THRESHOLD         132000000
#define STM32_6WS_THRESHOLD         154000000
#define STM32_7WS_THRESHOLD         176000000
#define STM32_8WS_THRESHOLD         180000000
#define STM32_FLASH_PSIZE           1
#elif (STM32_VDD >= 180) && (STM32_VDD < 210)
#define STM32_0WS_THRESHOLD         20000000
#define STM32_1WS_THRESHOLD         40000000
#define STM32_2WS_THRESHOLD         60000000
#define STM32_3WS_THRESHOLD         80000000
#define STM32_4WS_THRESHOLD         100000000
#define STM32_5WS_THRESHOLD         120000000
#define STM32_6WS_THRESHOLD         140000000
#define STM32_7WS_THRESHOLD         168000000
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           0
#else
#error "invalid VDD voltage specified"
#endif

#elif defined(STM32F412xx)
#if (STM32_VDD >= 270) && (STM32_VDD <= 360)
#define STM32_0WS_THRESHOLD         30000000
#define STM32_1WS_THRESHOLD         64000000
#define STM32_2WS_THRESHOLD         90000000
#define STM32_3WS_THRESHOLD         100000000
#define STM32_4WS_THRESHOLD         0
#define STM32_5WS_THRESHOLD         0
#define STM32_6WS_THRESHOLD         0
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           2
#elif (STM32_VDD >= 240) && (STM32_VDD < 270)
#define STM32_0WS_THRESHOLD         24000000
#define STM32_1WS_THRESHOLD         48000000
#define STM32_2WS_THRESHOLD         72000000
#define STM32_3WS_THRESHOLD         96000000
#define STM32_4WS_THRESHOLD         100000000
#define STM32_5WS_THRESHOLD         0
#define STM32_6WS_THRESHOLD         0
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           1
#elif (STM32_VDD >= 210) && (STM32_VDD < 240)
#define STM32_0WS_THRESHOLD         18000000
#define STM32_1WS_THRESHOLD         36000000
#define STM32_2WS_THRESHOLD         54000000
#define STM32_3WS_THRESHOLD         72000000
#define STM32_4WS_THRESHOLD         90000000
#define STM32_5WS_THRESHOLD         100000000
#define STM32_6WS_THRESHOLD         0
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           1
#elif (STM32_VDD >= 170) && (STM32_VDD < 210)
#define STM32_0WS_THRESHOLD         16000000
#define STM32_1WS_THRESHOLD         32000000
#define STM32_2WS_THRESHOLD         48000000
#define STM32_3WS_THRESHOLD         64000000
#define STM32_4WS_THRESHOLD         80000000
#define STM32_5WS_THRESHOLD         96000000
#define STM32_6WS_THRESHOLD         100000000
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           0
#else
#error "invalid VDD voltage specified"
#endif

#elif defined(STM32F410xx) || defined(STM32F411xx)
#if (STM32_VDD >= 270) && (STM32_VDD <= 360)
#define STM32_0WS_THRESHOLD         30000000
#define STM32_1WS_THRESHOLD         64000000
#define STM32_2WS_THRESHOLD         90000000
#define STM32_3WS_THRESHOLD         100000000
#define STM32_4WS_THRESHOLD         0
#define STM32_5WS_THRESHOLD         0
#define STM32_6WS_THRESHOLD         0
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           2
#elif (STM32_VDD >= 240) && (STM32_VDD < 270)
#define STM32_0WS_THRESHOLD         24000000
#define STM32_1WS_THRESHOLD         48000000
#define STM32_2WS_THRESHOLD         72000000
#define STM32_3WS_THRESHOLD         96000000
#define STM32_4WS_THRESHOLD         100000000
#define STM32_5WS_THRESHOLD         0
#define STM32_6WS_THRESHOLD         0
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           1
#elif (STM32_VDD >= 210) && (STM32_VDD < 240)
#define STM32_0WS_THRESHOLD         18000000
#define STM32_1WS_THRESHOLD         36000000
#define STM32_2WS_THRESHOLD         54000000
#define STM32_3WS_THRESHOLD         72000000
#define STM32_4WS_THRESHOLD         90000000
#define STM32_5WS_THRESHOLD         100000000
#define STM32_6WS_THRESHOLD         0
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           1
#elif (STM32_VDD >= 171) && (STM32_VDD < 210)
#define STM32_0WS_THRESHOLD         16000000
#define STM32_1WS_THRESHOLD         32000000
#define STM32_2WS_THRESHOLD         48000000
#define STM32_3WS_THRESHOLD         64000000
#define STM32_4WS_THRESHOLD         80000000
#define STM32_5WS_THRESHOLD         96000000
#define STM32_6WS_THRESHOLD         100000000
#define STM32_7WS_THRESHOLD         0
#define STM32_8WS_THRESHOLD         0
#define STM32_FLASH_PSIZE           0

#else
#error "invalid VDD voltage specified"
#endif

